app/controllers/main_page_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_type" = $1  [["user_type", 0]]
SELECT "products".* FROM "products"
---
  def index
    @users = User.where(user_type: 'restaurant')
    @product = Product.all