app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-04-01 08:02:03.719105"], ["updated_at", "2021-04-01 08:02:03.719105"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save